codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efh064.h
#define _IFS4_SPI2TXIF_POSITION                  0x00000010
#define _IFS4_SPI2TXIF_MASK                      0x00010000
#define _IFS4_SPI2TXIF_LENGTH                    0x00000001

#define _IFS4_U2EIF_POSITION                     0x00000011
#define _IFS4_U2EIF_MASK                         0x00020000
#define _IFS4_U2EIF_LENGTH                       0x00000001

#define _IFS4_U2RXIF_POSITION                    0x00000012
#define _IFS4_U2RXIF_MASK                        0x00040000
#define _IFS4_U2RXIF_LENGTH                      0x00000001

#define _IFS4_U2TXIF_POSITION                    0x00000013
#define _IFS4_U2TXIF_MASK                        0x00080000
#define _IFS4_U2TXIF_LENGTH                      0x00000001

#define _IFS4_CAN1IF_POSITION                    0x00000017
#define _IFS4_CAN1IF_MASK                        0x00800000
#define _IFS4_CAN1IF_LENGTH                      0x00000001

#define _IFS4_CAN2IF_POSITION                    0x00000018
#define _IFS4_CAN2IF_MASK                        0x01000000
#define _IFS4_CAN2IF_LENGTH                      0x00000001

#define _IFS4_ETHIF_POSITION                     0x00000019
#define _IFS4_ETHIF_MASK                         0x02000000
#define _IFS4_ETHIF_LENGTH                       0x00000001

#define _IFS4_SPI3EIF_POSITION                   0x0000001A
#define _IFS4_SPI3EIF_MASK                       0x04000000
#define _IFS4_SPI3EIF_LENGTH                     0x00000001

#define _IFS4_SPI3RXIF_POSITION                  0x0000001B
#define _IFS4_SPI3RXIF_MASK                      0x08000000
#define _IFS4_SPI3RXIF_LENGTH                    0x00000001

#define _IFS4_SPI3TXIF_POSITION                  0x0000001C
#define _IFS4_SPI3TXIF_MASK                      0x10000000
#define _IFS4_SPI3TXIF_LENGTH                    0x00000001

#define _IFS4_U3EIF_POSITION                     0x0000001D
#define _IFS4_U3EIF_MASK                         0x20000000
#define _IFS4_U3EIF_LENGTH                       0x00000001

#define _IFS4_U3RXIF_POSITION                    0x0000001E
#define _IFS4_U3RXIF_MASK                        0x40000000
#define _IFS4_U3RXIF_LENGTH                      0x00000001

#define _IFS4_U3TXIF_POSITION                    0x0000001F
#define _IFS4_U3TXIF_MASK                        0x80000000
#define _IFS4_U3TXIF_LENGTH                      0x00000001

#define _IFS4_w_POSITION                         0x00000000
#define _IFS4_w_MASK                             0xFFFFFFFF
#define _IFS4_w_LENGTH                           0x00000020

#define _IFS5_I2C3BIF_POSITION                   0x00000000
#define _IFS5_I2C3BIF_MASK                       0x00000001
#define _IFS5_I2C3BIF_LENGTH                     0x00000001

#define _IFS5_I2C3SIF_POSITION                   0x00000001
#define _IFS5_I2C3SIF_MASK                       0x00000002
#define _IFS5_I2C3SIF_LENGTH                     0x00000001

#define _IFS5_I2C3MIF_POSITION                   0x00000002
#define _IFS5_I2C3MIF_MASK                       0x00000004
#define _IFS5_I2C3MIF_LENGTH                     0x00000001

#define _IFS5_SPI4EIF_POSITION                   0x00000003
#define _IFS5_SPI4EIF_MASK                       0x00000008
#define _IFS5_SPI4EIF_LENGTH                     0x00000001

#define _IFS5_SPI4RXIF_POSITION                  0x00000004
#define _IFS5_SPI4RXIF_MASK                      0x00000010
#define _IFS5_SPI4RXIF_LENGTH                    0x00000001

#define _IFS5_SPI4TXIF_POSITION                  0x00000005
#define _IFS5_SPI4TXIF_MASK                      0x00000020
#define _IFS5_SPI4TXIF_LENGTH                    0x00000001

#define _IFS5_RTCCIF_POSITION                    0x00000006
#define _IFS5_RTCCIF_MASK                        0x00000040
#define _IFS5_RTCCIF_LENGTH                      0x00000001

#define _IFS5_FCEIF_POSITION                     0x00000007
#define _IFS5_FCEIF_MASK                         0x00000080
#define _IFS5_FCEIF_LENGTH                       0x00000001

#define _IFS5_PREIF_POSITION                     0x00000008
#define _IFS5_PREIF_MASK                         0x00000100
#define _IFS5_PREIF_LENGTH                       0x00000001

#define _IFS5_SQI1IF_POSITION                    0x00000009
#define _IFS5_SQI1IF_MASK                        0x00000200
#define _IFS5_SQI1IF_LENGTH                      0x00000001

#define _IFS5_U4EIF_POSITION                     0x0000000A
#define _IFS5_U4EIF_MASK                         0x00000400
#define _IFS5_U4EIF_LENGTH                       0x00000001

#define _IFS5_U4RXIF_POSITION                    0x0000000B
#define _IFS5_U4RXIF_MASK                        0x00000800
#define _IFS5_U4RXIF_LENGTH                      0x00000001

#define _IFS5_U4TXIF_POSITION                    0x0000000C
#define _IFS5_U4TXIF_MASK                        0x00001000
#define _IFS5_U4TXIF_LENGTH                      0x00000001

#define _IFS5_I2C4BIF_POSITION                   0x0000000D
#define _IFS5_I2C4BIF_MASK                       0x00002000
#define _IFS5_I2C4BIF_LENGTH                     0x00000001

#define _IFS5_I2C4SIF_POSITION                   0x0000000E
#define _IFS5_I2C4SIF_MASK                       0x00004000
#define _IFS5_I2C4SIF_LENGTH                     0x00000001

#define _IFS5_I2C4MIF_POSITION                   0x0000000F
#define _IFS5_I2C4MIF_MASK                       0x00008000
#define _IFS5_I2C4MIF_LENGTH                     0x00000001

#define _IFS5_U5EIF_POSITION                     0x00000013
#define _IFS5_U5EIF_MASK                         0x00080000
#define _IFS5_U5EIF_LENGTH                       0x00000001

#define _IFS5_U5RXIF_POSITION                    0x00000014
#define _IFS5_U5RXIF_MASK                        0x00100000
#define _IFS5_U5RXIF_LENGTH                      0x00000001

#define _IFS5_U5TXIF_POSITION                    0x00000015
#define _IFS5_U5TXIF_MASK                        0x00200000
#define _IFS5_U5TXIF_LENGTH                      0x00000001

#define _IFS5_I2C5BIF_POSITION                   0x00000016
#define _IFS5_I2C5BIF_MASK                       0x00400000
#define _IFS5_I2C5BIF_LENGTH                     0x00000001

#define _IFS5_I2C5SIF_POSITION                   0x00000017
#define _IFS5_I2C5SIF_MASK                       0x00800000
#define _IFS5_I2C5SIF_LENGTH                     0x00000001

#define _IFS5_I2C5MIF_POSITION                   0x00000018
#define _IFS5_I2C5MIF_MASK                       0x01000000
#define _IFS5_I2C5MIF_LENGTH                     0x00000001

