codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efh064.h
#define _IEC1_ADCD2IE_POSITION                   0x0000001D
#define _IEC1_ADCD2IE_MASK                       0x20000000
#define _IEC1_ADCD2IE_LENGTH                     0x00000001

#define _IEC1_ADCD3IE_POSITION                   0x0000001E
#define _IEC1_ADCD3IE_MASK                       0x40000000
#define _IEC1_ADCD3IE_LENGTH                     0x00000001

#define _IEC1_ADCD4IE_POSITION                   0x0000001F
#define _IEC1_ADCD4IE_MASK                       0x80000000
#define _IEC1_ADCD4IE_LENGTH                     0x00000001

#define _IEC1_w_POSITION                         0x00000000
#define _IEC1_w_MASK                             0xFFFFFFFF
#define _IEC1_w_LENGTH                           0x00000020

#define _IEC2_ADCD5IE_POSITION                   0x00000000
#define _IEC2_ADCD5IE_MASK                       0x00000001
#define _IEC2_ADCD5IE_LENGTH                     0x00000001

#define _IEC2_ADCD6IE_POSITION                   0x00000001
#define _IEC2_ADCD6IE_MASK                       0x00000002
#define _IEC2_ADCD6IE_LENGTH                     0x00000001

#define _IEC2_ADCD7IE_POSITION                   0x00000002
#define _IEC2_ADCD7IE_MASK                       0x00000004
#define _IEC2_ADCD7IE_LENGTH                     0x00000001

#define _IEC2_ADCD8IE_POSITION                   0x00000003
#define _IEC2_ADCD8IE_MASK                       0x00000008
#define _IEC2_ADCD8IE_LENGTH                     0x00000001

#define _IEC2_ADCD9IE_POSITION                   0x00000004
#define _IEC2_ADCD9IE_MASK                       0x00000010
#define _IEC2_ADCD9IE_LENGTH                     0x00000001

#define _IEC2_ADCD10IE_POSITION                  0x00000005
#define _IEC2_ADCD10IE_MASK                      0x00000020
#define _IEC2_ADCD10IE_LENGTH                    0x00000001

#define _IEC2_ADCD11IE_POSITION                  0x00000006
#define _IEC2_ADCD11IE_MASK                      0x00000040
#define _IEC2_ADCD11IE_LENGTH                    0x00000001

#define _IEC2_ADCD12IE_POSITION                  0x00000007
#define _IEC2_ADCD12IE_MASK                      0x00000080
#define _IEC2_ADCD12IE_LENGTH                    0x00000001

#define _IEC2_ADCD13IE_POSITION                  0x00000008
#define _IEC2_ADCD13IE_MASK                      0x00000100
#define _IEC2_ADCD13IE_LENGTH                    0x00000001

#define _IEC2_ADCD14IE_POSITION                  0x00000009
#define _IEC2_ADCD14IE_MASK                      0x00000200
#define _IEC2_ADCD14IE_LENGTH                    0x00000001

#define _IEC2_ADCD15IE_POSITION                  0x0000000A
#define _IEC2_ADCD15IE_MASK                      0x00000400
#define _IEC2_ADCD15IE_LENGTH                    0x00000001

#define _IEC2_ADCD16IE_POSITION                  0x0000000B
#define _IEC2_ADCD16IE_MASK                      0x00000800
#define _IEC2_ADCD16IE_LENGTH                    0x00000001

#define _IEC2_ADCD17IE_POSITION                  0x0000000C
#define _IEC2_ADCD17IE_MASK                      0x00001000
#define _IEC2_ADCD17IE_LENGTH                    0x00000001

#define _IEC2_ADCD18IE_POSITION                  0x0000000D
#define _IEC2_ADCD18IE_MASK                      0x00002000
#define _IEC2_ADCD18IE_LENGTH                    0x00000001

#define _IEC2_w_POSITION                         0x00000000
#define _IEC2_w_MASK                             0xFFFFFFFF
#define _IEC2_w_LENGTH                           0x00000020

#define _IEC3_ADCD43IE_POSITION                  0x00000006
#define _IEC3_ADCD43IE_MASK                      0x00000040
#define _IEC3_ADCD43IE_LENGTH                    0x00000001

#define _IEC3_ADCD44IE_POSITION                  0x00000007
#define _IEC3_ADCD44IE_MASK                      0x00000080
#define _IEC3_ADCD44IE_LENGTH                    0x00000001

#define _IEC3_CPCIE_POSITION                     0x00000008
#define _IEC3_CPCIE_MASK                         0x00000100
#define _IEC3_CPCIE_LENGTH                       0x00000001

#define _IEC3_CFDCIE_POSITION                    0x00000009
#define _IEC3_CFDCIE_MASK                        0x00000200
#define _IEC3_CFDCIE_LENGTH                      0x00000001

#define _IEC3_SBIE_POSITION                      0x0000000A
#define _IEC3_SBIE_MASK                          0x00000400
#define _IEC3_SBIE_LENGTH                        0x00000001

#define _IEC3_SPI1EIE_POSITION                   0x0000000D
#define _IEC3_SPI1EIE_MASK                       0x00002000
#define _IEC3_SPI1EIE_LENGTH                     0x00000001

#define _IEC3_SPI1RXIE_POSITION                  0x0000000E
#define _IEC3_SPI1RXIE_MASK                      0x00004000
#define _IEC3_SPI1RXIE_LENGTH                    0x00000001

#define _IEC3_SPI1TXIE_POSITION                  0x0000000F
#define _IEC3_SPI1TXIE_MASK                      0x00008000
#define _IEC3_SPI1TXIE_LENGTH                    0x00000001

#define _IEC3_U1EIE_POSITION                     0x00000010
#define _IEC3_U1EIE_MASK                         0x00010000
#define _IEC3_U1EIE_LENGTH                       0x00000001

#define _IEC3_U1RXIE_POSITION                    0x00000011
#define _IEC3_U1RXIE_MASK                        0x00020000
#define _IEC3_U1RXIE_LENGTH                      0x00000001

#define _IEC3_U1TXIE_POSITION                    0x00000012
#define _IEC3_U1TXIE_MASK                        0x00040000
#define _IEC3_U1TXIE_LENGTH                      0x00000001

#define _IEC3_I2C1BIE_POSITION                   0x00000013
#define _IEC3_I2C1BIE_MASK                       0x00080000
#define _IEC3_I2C1BIE_LENGTH                     0x00000001

#define _IEC3_I2C1SIE_POSITION                   0x00000014
#define _IEC3_I2C1SIE_MASK                       0x00100000
#define _IEC3_I2C1SIE_LENGTH                     0x00000001

#define _IEC3_I2C1MIE_POSITION                   0x00000015
#define _IEC3_I2C1MIE_MASK                       0x00200000
#define _IEC3_I2C1MIE_LENGTH                     0x00000001

#define _IEC3_CNBIE_POSITION                     0x00000017
#define _IEC3_CNBIE_MASK                         0x00800000
#define _IEC3_CNBIE_LENGTH                       0x00000001

#define _IEC3_CNCIE_POSITION                     0x00000018
#define _IEC3_CNCIE_MASK                         0x01000000
#define _IEC3_CNCIE_LENGTH                       0x00000001

#define _IEC3_CNDIE_POSITION                     0x00000019
#define _IEC3_CNDIE_MASK                         0x02000000
#define _IEC3_CNDIE_LENGTH                       0x00000001

