codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efh064.h
#define _UABSTA_w_POSITION                       0x00000000
#define _UABSTA_w_MASK                           0xFFFFFFFF
#define _UABSTA_w_LENGTH                         0x00000020

#define _U2MODE_STSEL_POSITION                   0x00000000
#define _U2MODE_STSEL_MASK                       0x00000001
#define _U2MODE_STSEL_LENGTH                     0x00000001

#define _U2MODE_PDSEL_POSITION                   0x00000001
#define _U2MODE_PDSEL_MASK                       0x00000006
#define _U2MODE_PDSEL_LENGTH                     0x00000002

#define _U2MODE_BRGH_POSITION                    0x00000003
#define _U2MODE_BRGH_MASK                        0x00000008
#define _U2MODE_BRGH_LENGTH                      0x00000001

#define _U2MODE_RXINV_POSITION                   0x00000004
#define _U2MODE_RXINV_MASK                       0x00000010
#define _U2MODE_RXINV_LENGTH                     0x00000001

#define _U2MODE_ABAUD_POSITION                   0x00000005
#define _U2MODE_ABAUD_MASK                       0x00000020
#define _U2MODE_ABAUD_LENGTH                     0x00000001

#define _U2MODE_LPBACK_POSITION                  0x00000006
#define _U2MODE_LPBACK_MASK                      0x00000040
#define _U2MODE_LPBACK_LENGTH                    0x00000001

#define _U2MODE_WAKE_POSITION                    0x00000007
#define _U2MODE_WAKE_MASK                        0x00000080
#define _U2MODE_WAKE_LENGTH                      0x00000001

#define _U2MODE_UEN_POSITION                     0x00000008
#define _U2MODE_UEN_MASK                         0x00000300
#define _U2MODE_UEN_LENGTH                       0x00000002

#define _U2MODE_RTSMD_POSITION                   0x0000000B
#define _U2MODE_RTSMD_MASK                       0x00000800
#define _U2MODE_RTSMD_LENGTH                     0x00000001

#define _U2MODE_IREN_POSITION                    0x0000000C
#define _U2MODE_IREN_MASK                        0x00001000
#define _U2MODE_IREN_LENGTH                      0x00000001

#define _U2MODE_SIDL_POSITION                    0x0000000D
#define _U2MODE_SIDL_MASK                        0x00002000
#define _U2MODE_SIDL_LENGTH                      0x00000001

#define _U2MODE_ON_POSITION                      0x0000000F
#define _U2MODE_ON_MASK                          0x00008000
#define _U2MODE_ON_LENGTH                        0x00000001

#define _U2MODE_PDSEL0_POSITION                  0x00000001
#define _U2MODE_PDSEL0_MASK                      0x00000002
#define _U2MODE_PDSEL0_LENGTH                    0x00000001

#define _U2MODE_PDSEL1_POSITION                  0x00000002
#define _U2MODE_PDSEL1_MASK                      0x00000004
#define _U2MODE_PDSEL1_LENGTH                    0x00000001

#define _U2MODE_UEN0_POSITION                    0x00000008
#define _U2MODE_UEN0_MASK                        0x00000100
#define _U2MODE_UEN0_LENGTH                      0x00000001

#define _U2MODE_UEN1_POSITION                    0x00000009
#define _U2MODE_UEN1_MASK                        0x00000200
#define _U2MODE_UEN1_LENGTH                      0x00000001

#define _U2MODE_USIDL_POSITION                   0x0000000D
#define _U2MODE_USIDL_MASK                       0x00002000
#define _U2MODE_USIDL_LENGTH                     0x00000001

#define _U2MODE_UARTEN_POSITION                  0x0000000F
#define _U2MODE_UARTEN_MASK                      0x00008000
#define _U2MODE_UARTEN_LENGTH                    0x00000001

#define _U2MODE_w_POSITION                       0x00000000
#define _U2MODE_w_MASK                           0xFFFFFFFF
#define _U2MODE_w_LENGTH                         0x00000020

#define _UCDMODE_STSEL_POSITION                  0x00000000
#define _UCDMODE_STSEL_MASK                      0x00000001
#define _UCDMODE_STSEL_LENGTH                    0x00000001

#define _UCDMODE_PDSEL_POSITION                  0x00000001
#define _UCDMODE_PDSEL_MASK                      0x00000006
#define _UCDMODE_PDSEL_LENGTH                    0x00000002

#define _UCDMODE_BRGH_POSITION                   0x00000003
#define _UCDMODE_BRGH_MASK                       0x00000008
#define _UCDMODE_BRGH_LENGTH                     0x00000001

#define _UCDMODE_RXINV_POSITION                  0x00000004
#define _UCDMODE_RXINV_MASK                      0x00000010
#define _UCDMODE_RXINV_LENGTH                    0x00000001

#define _UCDMODE_ABAUD_POSITION                  0x00000005
#define _UCDMODE_ABAUD_MASK                      0x00000020
#define _UCDMODE_ABAUD_LENGTH                    0x00000001

#define _UCDMODE_LPBACK_POSITION                 0x00000006
#define _UCDMODE_LPBACK_MASK                     0x00000040
#define _UCDMODE_LPBACK_LENGTH                   0x00000001

#define _UCDMODE_WAKE_POSITION                   0x00000007
#define _UCDMODE_WAKE_MASK                       0x00000080
#define _UCDMODE_WAKE_LENGTH                     0x00000001

#define _UCDMODE_UEN_POSITION                    0x00000008
#define _UCDMODE_UEN_MASK                        0x00000300
#define _UCDMODE_UEN_LENGTH                      0x00000002

#define _UCDMODE_RTSMD_POSITION                  0x0000000B
#define _UCDMODE_RTSMD_MASK                      0x00000800
#define _UCDMODE_RTSMD_LENGTH                    0x00000001

#define _UCDMODE_IREN_POSITION                   0x0000000C
#define _UCDMODE_IREN_MASK                       0x00001000
#define _UCDMODE_IREN_LENGTH                     0x00000001

#define _UCDMODE_SIDL_POSITION                   0x0000000D
#define _UCDMODE_SIDL_MASK                       0x00002000
#define _UCDMODE_SIDL_LENGTH                     0x00000001

#define _UCDMODE_ON_POSITION                     0x0000000F
#define _UCDMODE_ON_MASK                         0x00008000
#define _UCDMODE_ON_LENGTH                       0x00000001

#define _UCDMODE_PDSEL0_POSITION                 0x00000001
#define _UCDMODE_PDSEL0_MASK                     0x00000002
#define _UCDMODE_PDSEL0_LENGTH                   0x00000001

#define _UCDMODE_PDSEL1_POSITION                 0x00000002
#define _UCDMODE_PDSEL1_MASK                     0x00000004
#define _UCDMODE_PDSEL1_LENGTH                   0x00000001

#define _UCDMODE_UEN0_POSITION                   0x00000008
#define _UCDMODE_UEN0_MASK                       0x00000100
#define _UCDMODE_UEN0_LENGTH                     0x00000001

